Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ128DA110.h
extern volatile G1DPADRHBITS G1DPADRHbits __attribute__((__sfr__));

#define G1DPW G1DPW
extern volatile unsigned int  G1DPW __attribute__((__sfr__));
__extension__ typedef struct tagG1DPWBITS {
  union {
    struct {
      unsigned DPW:11;
    };
    struct {
      unsigned DPW0:1;
      unsigned DPW1:1;
      unsigned DPW2:1;
      unsigned DPW3:1;
      unsigned DPW4:1;
      unsigned DPW5:1;
      unsigned DPW6:1;
      unsigned DPW7:1;
      unsigned DPW8:1;
      unsigned DPW9:1;
      unsigned DPW10:1;
    };
  };
} G1DPWBITS;
extern volatile G1DPWBITS G1DPWbits __attribute__((__sfr__));

#define G1DPH G1DPH
extern volatile unsigned int  G1DPH __attribute__((__sfr__));
__extension__ typedef struct tagG1DPHBITS {
  union {
    struct {
      unsigned DPH:11;
    };
    struct {
      unsigned DPH0:1;
      unsigned DPH1:1;
      unsigned DPH2:1;
      unsigned DPH3:1;
      unsigned DPH4:1;
      unsigned DPH5:1;
      unsigned DPH6:1;
      unsigned DPH7:1;
      unsigned DPH8:1;
      unsigned DPH9:1;
      unsigned DPH10:1;
    };
  };
} G1DPHBITS;
extern volatile G1DPHBITS G1DPHbits __attribute__((__sfr__));

#define G1DPWT G1DPWT
extern volatile unsigned int  G1DPWT __attribute__((__sfr__));
__extension__ typedef struct tagG1DPWTBITS {
  union {
    struct {
      unsigned DPWT:11;
    };
    struct {
      unsigned DPWT0:1;
      unsigned DPWT1:1;
      unsigned DPWT2:1;
      unsigned DPWT3:1;
      unsigned DPWT4:1;
      unsigned DPWT5:1;
      unsigned DPWT6:1;
      unsigned DPWT7:1;
      unsigned DPWT8:1;
      unsigned DPWT9:1;
      unsigned DPWT10:1;
    };
  };
} G1DPWTBITS;
extern volatile G1DPWTBITS G1DPWTbits __attribute__((__sfr__));

#define G1DPHT G1DPHT
extern volatile unsigned int  G1DPHT __attribute__((__sfr__));
__extension__ typedef struct tagG1DPHTBITS {
  union {
    struct {
      unsigned DPHT:11;
    };
    struct {
      unsigned DPHT0:1;
      unsigned DPHT1:1;
      unsigned DPHT2:1;
      unsigned DPHT3:1;
      unsigned DPHT4:1;
      unsigned DPHT5:1;
      unsigned DPHT6:1;
      unsigned DPHT7:1;
      unsigned DPHT8:1;
      unsigned DPHT9:1;
      unsigned DPHT10:1;
    };
  };
} G1DPHTBITS;
extern volatile G1DPHTBITS G1DPHTbits __attribute__((__sfr__));

#define G1CON2 G1CON2
extern volatile unsigned int  G1CON2 __attribute__((__sfr__));
__extension__ typedef struct tagG1CON2BITS {
  union {
    struct {
      unsigned DPMODE:3;
      unsigned :2;
      unsigned DPBPP:3;
      unsigned DPTEST:2;
      unsigned :2;
      unsigned DPSTGER:2;
      unsigned DPGWDTH:2;
    };
    struct {
      unsigned DPMODE0:1;
      unsigned DPMODE1:1;
      unsigned DPMODE2:1;
      unsigned :2;
      unsigned DPBPP0:1;
      unsigned DPBPP1:1;
      unsigned DPBPP2:1;
      unsigned DPTEST0:1;
      unsigned DPTEST1:1;
      unsigned :2;
      unsigned DPSTGER0:1;
      unsigned DPSTGER1:1;
      unsigned DPGWDTH0:1;
      unsigned DPGWDTH1:1;
    };
  };
} G1CON2BITS;
extern volatile G1CON2BITS G1CON2bits __attribute__((__sfr__));

#define G1CON3 G1CON3
extern volatile unsigned int  G1CON3 __attribute__((__sfr__));
typedef struct tagG1CON3BITS {
  unsigned DPHSOE:1;
  unsigned DPVSOE:1;
  unsigned DPENOE:1;
  unsigned DPPWROE:1;
  unsigned DPHSPOL:1;
  unsigned DPVSPOL:1;
  unsigned DPENPOL:1;
  unsigned DPCLKPOL:1;
  unsigned DPPOWER:1;
  unsigned DPPINOE:1;
} G1CON3BITS;
extern volatile G1CON3BITS G1CON3bits __attribute__((__sfr__));

#define G1ACTDA G1ACTDA
extern volatile unsigned int  G1ACTDA __attribute__((__sfr__));
__extension__ typedef struct tagG1ACTDABITS {
  union {
    struct {
      unsigned ACTPIX:8;
      unsigned ACTLINE:8;
    };
    struct {
      unsigned ACTPIX0:1;
      unsigned ACTPIX1:1;
      unsigned ACTPIX2:1;
      unsigned ACTPIX3:1;
      unsigned ACTPIX4:1;
      unsigned ACTPIX5:1;
      unsigned ACTPIX6:1;
      unsigned ACTPIX7:1;
      unsigned ACTLINE0:1;
      unsigned ACTLINE1:1;
      unsigned ACTLINE2:1;
      unsigned ACTLINE3:1;
      unsigned ACTLINE4:1;
      unsigned ACTLINE5:1;
      unsigned ACTLINE6:1;
      unsigned ACTLINE7:1;
    };
  };
} G1ACTDABITS;
extern volatile G1ACTDABITS G1ACTDAbits __attribute__((__sfr__));

#define G1HSYNC G1HSYNC
extern volatile unsigned int  G1HSYNC __attribute__((__sfr__));
__extension__ typedef struct tagG1HSYNCBITS {
  union {
    struct {
      unsigned HSST:8;
      unsigned HSLEN:8;
    };
    struct {
      unsigned HSST0:1;
      unsigned HSST1:1;
      unsigned HSST2:1;
      unsigned HSST3:1;
      unsigned HSST4:1;
      unsigned HSST5:1;
      unsigned HSST6:1;
      unsigned HSST7:1;
      unsigned HSLEN0:1;
      unsigned HSLEN1:1;
      unsigned HSLEN2:1;
      unsigned HSLEN3:1;
      unsigned HSLEN4:1;
      unsigned HSLEN5:1;
      unsigned HSLEN6:1;
      unsigned HSLEN7:1;
    };
  };
} G1HSYNCBITS;
extern volatile G1HSYNCBITS G1HSYNCbits __attribute__((__sfr__));

#define G1VSYNC G1VSYNC
extern volatile unsigned int  G1VSYNC __attribute__((__sfr__));
__extension__ typedef struct tagG1VSYNCBITS {
  union {
    struct {
      unsigned VSST:8;
      unsigned VSLEN:8;
    };
    struct {
      unsigned VSST0:1;
      unsigned VSST1:1;
      unsigned VSST2:1;
      unsigned VSST3:1;
      unsigned VSST4:1;
      unsigned VSST5:1;
      unsigned VSST6:1;
      unsigned VSST7:1;
      unsigned VSLEN0:1;
      unsigned VSLEN1:1;
      unsigned VSLEN2:1;
      unsigned VSLEN3:1;
      unsigned VSLEN4:1;
      unsigned VSLEN5:1;
      unsigned VSLEN6:1;
      unsigned VSLEN7:1;
    };
  };
} G1VSYNCBITS;
extern volatile G1VSYNCBITS G1VSYNCbits __attribute__((__sfr__));

#define G1DBLCON G1DBLCON
extern volatile unsigned int  G1DBLCON __attribute__((__sfr__));
__extension__ typedef struct tagG1DBLCONBITS {
  union {
    struct {
      unsigned HENST:8;
      unsigned VENST:8;
    };
    struct {
      unsigned HENST0:1;
      unsigned HENST1:1;
      unsigned HENST2:1;
      unsigned HENST3:1;
      unsigned HENST4:1;
      unsigned HENST5:1;
      unsigned HENST6:1;
      unsigned HENST7:1;
      unsigned VENST0:1;
      unsigned VENST1:1;
      unsigned VENST2:1;
      unsigned VENST3:1;
      unsigned VENST4:1;
      unsigned VENST5:1;
      unsigned VENST6:1;
      unsigned VENST7:1;
    };
  };
} G1DBLCONBITS;
extern volatile G1DBLCONBITS G1DBLCONbits __attribute__((__sfr__));

