Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ128DA110.h
/* G1CMDH */
#define _GCMD16 G1CMDHbits.GCMD16
#define _GCMD17 G1CMDHbits.GCMD17
#define _GCMD18 G1CMDHbits.GCMD18
#define _GCMD19 G1CMDHbits.GCMD19
#define _GCMD20 G1CMDHbits.GCMD20
#define _GCMD21 G1CMDHbits.GCMD21
#define _GCMD22 G1CMDHbits.GCMD22
#define _GCMD23 G1CMDHbits.GCMD23
#define _GCMD24 G1CMDHbits.GCMD24
#define _GCMD25 G1CMDHbits.GCMD25
#define _GCMD26 G1CMDHbits.GCMD26
#define _GCMD27 G1CMDHbits.GCMD27
#define _GCMD28 G1CMDHbits.GCMD28
#define _GCMD29 G1CMDHbits.GCMD29
#define _GCMD30 G1CMDHbits.GCMD30
#define _GCMD31 G1CMDHbits.GCMD31

/* G1CON1 */
#define _GCMDCNT G1CON1bits.GCMDCNT
#define _PUBPP G1CON1bits.PUBPP
#define _GCMDWMK G1CON1bits.GCMDWMK
#define _G1SIDL G1CON1bits.G1SIDL
#define _G1EN G1CON1bits.G1EN
#define _GCMDCNT0 G1CON1bits.GCMDCNT0
#define _GCMDCNT1 G1CON1bits.GCMDCNT1
#define _GCMDCNT2 G1CON1bits.GCMDCNT2
#define _GCMDCNT3 G1CON1bits.GCMDCNT3
#define _GCMDCNT4 G1CON1bits.GCMDCNT4
#define _PUBPP0 G1CON1bits.PUBPP0
#define _PUBPP1 G1CON1bits.PUBPP1
#define _PUBPP2 G1CON1bits.PUBPP2
#define _GCMDWMK0 G1CON1bits.GCMDWMK0
#define _GCMDWMK1 G1CON1bits.GCMDWMK1
#define _GCMDWMK2 G1CON1bits.GCMDWMK2
#define _GCMDWMK3 G1CON1bits.GCMDWMK3
#define _GCMDWMK4 G1CON1bits.GCMDWMK4

/* G1STAT */
#define _CMDMPT G1STATbits.CMDMPT
#define _CMDFUL G1STATbits.CMDFUL
#define _CMDLV G1STATbits.CMDLV
#define _HMRGN G1STATbits.HMRGN
#define _VMRGN G1STATbits.VMRGN
#define _CHRBUSY G1STATbits.CHRBUSY
#define _RCCBUSY G1STATbits.RCCBUSY
#define _IPUBUSY G1STATbits.IPUBUSY
#define _PUBUSY G1STATbits.PUBUSY

/* G1IE */
#define _CMDMPTIE G1IEbits.CMDMPTIE
#define _CMDFULIE G1IEbits.CMDFULIE
#define _CMDLVIE G1IEbits.CMDLVIE
#define _HMRGNIE G1IEbits.HMRGNIE
#define _VMRGNIE G1IEbits.VMRGNIE
#define _CHRIE G1IEbits.CHRIE
#define _RCCIE G1IEbits.RCCIE
#define _IPUIE G1IEbits.IPUIE
#define _PUIE G1IEbits.PUIE

/* G1IR */
#define _CMDMPTIF G1IRbits.CMDMPTIF
#define _CMDFULIF G1IRbits.CMDFULIF
#define _CMDLVIF G1IRbits.CMDLVIF
#define _HMRGNIF G1IRbits.HMRGNIF
#define _VMRGNIF G1IRbits.VMRGNIF
#define _CHRIF G1IRbits.CHRIF
#define _RCCIF G1IRbits.RCCIF
#define _IPUIF G1IRbits.IPUIF
#define _PUIF G1IRbits.PUIF

/* G1W1ADRL */
#define _W1ADR0 G1W1ADRLbits.W1ADR0
#define _W1ADR1 G1W1ADRLbits.W1ADR1
#define _W1ADR2 G1W1ADRLbits.W1ADR2
#define _W1ADR3 G1W1ADRLbits.W1ADR3
#define _W1ADR4 G1W1ADRLbits.W1ADR4
#define _W1ADR5 G1W1ADRLbits.W1ADR5
#define _W1ADR6 G1W1ADRLbits.W1ADR6
#define _W1ADR7 G1W1ADRLbits.W1ADR7
#define _W1ADR8 G1W1ADRLbits.W1ADR8
#define _W1ADR9 G1W1ADRLbits.W1ADR9
#define _W1ADR10 G1W1ADRLbits.W1ADR10
#define _W1ADR11 G1W1ADRLbits.W1ADR11
#define _W1ADR12 G1W1ADRLbits.W1ADR12
#define _W1ADR13 G1W1ADRLbits.W1ADR13
#define _W1ADR14 G1W1ADRLbits.W1ADR14
#define _W1ADR15 G1W1ADRLbits.W1ADR15

/* G1W1ADRH */
#define _W1ADR16 G1W1ADRHbits.W1ADR16
#define _W1ADR17 G1W1ADRHbits.W1ADR17
#define _W1ADR18 G1W1ADRHbits.W1ADR18
#define _W1ADR19 G1W1ADRHbits.W1ADR19
#define _W1ADR20 G1W1ADRHbits.W1ADR20
#define _W1ADR21 G1W1ADRHbits.W1ADR21
#define _W1ADR22 G1W1ADRHbits.W1ADR22
#define _W1ADR23 G1W1ADRHbits.W1ADR23

/* G1W2ADRL */
#define _W2ADR0 G1W2ADRLbits.W2ADR0
#define _W2ADR1 G1W2ADRLbits.W2ADR1
#define _W2ADR2 G1W2ADRLbits.W2ADR2
#define _W2ADR3 G1W2ADRLbits.W2ADR3
#define _W2ADR4 G1W2ADRLbits.W2ADR4
#define _W2ADR5 G1W2ADRLbits.W2ADR5
#define _W2ADR6 G1W2ADRLbits.W2ADR6
#define _W2ADR7 G1W2ADRLbits.W2ADR7
#define _W2ADR8 G1W2ADRLbits.W2ADR8
#define _W2ADR9 G1W2ADRLbits.W2ADR9
#define _W2ADR10 G1W2ADRLbits.W2ADR10
#define _W2ADR11 G1W2ADRLbits.W2ADR11
#define _W2ADR12 G1W2ADRLbits.W2ADR12
#define _W2ADR13 G1W2ADRLbits.W2ADR13
#define _W2ADR14 G1W2ADRLbits.W2ADR14
#define _W2ADR15 G1W2ADRLbits.W2ADR15

/* G1W2ADRH */
#define _W2ADR16 G1W2ADRHbits.W2ADR16
#define _W2ADR17 G1W2ADRHbits.W2ADR17
#define _W2ADR18 G1W2ADRHbits.W2ADR18
#define _W2ADR19 G1W2ADRHbits.W2ADR19
#define _W2ADR20 G1W2ADRHbits.W2ADR20
#define _W2ADR21 G1W2ADRHbits.W2ADR21
#define _W2ADR22 G1W2ADRHbits.W2ADR22
#define _W2ADR23 G1W2ADRHbits.W2ADR23

/* G1PUW */
#define _PUW G1PUWbits.PUW
#define _PUW0 G1PUWbits.PUW0
#define _PUW1 G1PUWbits.PUW1
#define _PUW2 G1PUWbits.PUW2
#define _PUW3 G1PUWbits.PUW3
#define _PUW4 G1PUWbits.PUW4
#define _PUW5 G1PUWbits.PUW5
#define _PUW6 G1PUWbits.PUW6
#define _PUW7 G1PUWbits.PUW7
#define _PUW8 G1PUWbits.PUW8
#define _PUW9 G1PUWbits.PUW9
#define _PUW10 G1PUWbits.PUW10

/* G1PUH */
#define _PUH G1PUHbits.PUH
#define _PUH0 G1PUHbits.PUH0
#define _PUH1 G1PUHbits.PUH1
#define _PUH2 G1PUHbits.PUH2
#define _PUH3 G1PUHbits.PUH3
#define _PUH4 G1PUHbits.PUH4
#define _PUH5 G1PUHbits.PUH5
#define _PUH6 G1PUHbits.PUH6
#define _PUH7 G1PUHbits.PUH7
#define _PUH8 G1PUHbits.PUH8
#define _PUH9 G1PUHbits.PUH9
#define _PUH10 G1PUHbits.PUH10

/* G1DPADRL */
#define _DPADR0 G1DPADRLbits.DPADR0
#define _DPADR1 G1DPADRLbits.DPADR1
#define _DPADR2 G1DPADRLbits.DPADR2
#define _DPADR3 G1DPADRLbits.DPADR3
#define _DPADR4 G1DPADRLbits.DPADR4
#define _DPADR5 G1DPADRLbits.DPADR5
#define _DPADR6 G1DPADRLbits.DPADR6
#define _DPADR7 G1DPADRLbits.DPADR7
#define _DPADR8 G1DPADRLbits.DPADR8
#define _DPADR9 G1DPADRLbits.DPADR9
#define _DPADR10 G1DPADRLbits.DPADR10
#define _DPADR11 G1DPADRLbits.DPADR11
#define _DPADR12 G1DPADRLbits.DPADR12
#define _DPADR13 G1DPADRLbits.DPADR13
#define _DPADR14 G1DPADRLbits.DPADR14
#define _DPADR15 G1DPADRLbits.DPADR15

/* G1DPADRH */
#define _DPADR16 G1DPADRHbits.DPADR16
#define _DPADR17 G1DPADRHbits.DPADR17
#define _DPADR18 G1DPADRHbits.DPADR18
#define _DPADR19 G1DPADRHbits.DPADR19
#define _DPADR20 G1DPADRHbits.DPADR20
#define _DPADR21 G1DPADRHbits.DPADR21
#define _DPADR22 G1DPADRHbits.DPADR22
#define _DPADR23 G1DPADRHbits.DPADR23

/* G1DPW */
#define _DPW G1DPWbits.DPW
#define _DPW0 G1DPWbits.DPW0
#define _DPW1 G1DPWbits.DPW1
#define _DPW2 G1DPWbits.DPW2
#define _DPW3 G1DPWbits.DPW3
#define _DPW4 G1DPWbits.DPW4
#define _DPW5 G1DPWbits.DPW5
#define _DPW6 G1DPWbits.DPW6
#define _DPW7 G1DPWbits.DPW7
#define _DPW8 G1DPWbits.DPW8
#define _DPW9 G1DPWbits.DPW9
#define _DPW10 G1DPWbits.DPW10

/* G1DPH */
#define _DPH G1DPHbits.DPH
#define _DPH0 G1DPHbits.DPH0
#define _DPH1 G1DPHbits.DPH1
#define _DPH2 G1DPHbits.DPH2
#define _DPH3 G1DPHbits.DPH3
#define _DPH4 G1DPHbits.DPH4
#define _DPH5 G1DPHbits.DPH5
#define _DPH6 G1DPHbits.DPH6
#define _DPH7 G1DPHbits.DPH7
#define _DPH8 G1DPHbits.DPH8
#define _DPH9 G1DPHbits.DPH9
#define _DPH10 G1DPHbits.DPH10

/* G1DPWT */
#define _DPWT G1DPWTbits.DPWT
#define _DPWT0 G1DPWTbits.DPWT0
#define _DPWT1 G1DPWTbits.DPWT1
#define _DPWT2 G1DPWTbits.DPWT2
#define _DPWT3 G1DPWTbits.DPWT3
#define _DPWT4 G1DPWTbits.DPWT4
#define _DPWT5 G1DPWTbits.DPWT5
#define _DPWT6 G1DPWTbits.DPWT6
#define _DPWT7 G1DPWTbits.DPWT7
#define _DPWT8 G1DPWTbits.DPWT8
#define _DPWT9 G1DPWTbits.DPWT9
#define _DPWT10 G1DPWTbits.DPWT10

/* G1DPHT */
#define _DPHT G1DPHTbits.DPHT
#define _DPHT0 G1DPHTbits.DPHT0
#define _DPHT1 G1DPHTbits.DPHT1
#define _DPHT2 G1DPHTbits.DPHT2
#define _DPHT3 G1DPHTbits.DPHT3
#define _DPHT4 G1DPHTbits.DPHT4
#define _DPHT5 G1DPHTbits.DPHT5
#define _DPHT6 G1DPHTbits.DPHT6
#define _DPHT7 G1DPHTbits.DPHT7
#define _DPHT8 G1DPHTbits.DPHT8
#define _DPHT9 G1DPHTbits.DPHT9
#define _DPHT10 G1DPHTbits.DPHT10

/* G1CON2 */
#define _DPMODE G1CON2bits.DPMODE
#define _DPBPP G1CON2bits.DPBPP
#define _DPTEST G1CON2bits.DPTEST
#define _DPSTGER G1CON2bits.DPSTGER
#define _DPGWDTH G1CON2bits.DPGWDTH
#define _DPMODE0 G1CON2bits.DPMODE0
#define _DPMODE1 G1CON2bits.DPMODE1
#define _DPMODE2 G1CON2bits.DPMODE2
#define _DPBPP0 G1CON2bits.DPBPP0
#define _DPBPP1 G1CON2bits.DPBPP1
#define _DPBPP2 G1CON2bits.DPBPP2
#define _DPTEST0 G1CON2bits.DPTEST0
#define _DPTEST1 G1CON2bits.DPTEST1
#define _DPSTGER0 G1CON2bits.DPSTGER0
#define _DPSTGER1 G1CON2bits.DPSTGER1
#define _DPGWDTH0 G1CON2bits.DPGWDTH0
#define _DPGWDTH1 G1CON2bits.DPGWDTH1

/* G1CON3 */
#define _DPHSOE G1CON3bits.DPHSOE
#define _DPVSOE G1CON3bits.DPVSOE
#define _DPENOE G1CON3bits.DPENOE
#define _DPPWROE G1CON3bits.DPPWROE
#define _DPHSPOL G1CON3bits.DPHSPOL
#define _DPVSPOL G1CON3bits.DPVSPOL
#define _DPENPOL G1CON3bits.DPENPOL
#define _DPCLKPOL G1CON3bits.DPCLKPOL
#define _DPPOWER G1CON3bits.DPPOWER
#define _DPPINOE G1CON3bits.DPPINOE

/* G1ACTDA */
#define _ACTPIX G1ACTDAbits.ACTPIX
#define _ACTLINE G1ACTDAbits.ACTLINE
#define _ACTPIX0 G1ACTDAbits.ACTPIX0
#define _ACTPIX1 G1ACTDAbits.ACTPIX1
#define _ACTPIX2 G1ACTDAbits.ACTPIX2
#define _ACTPIX3 G1ACTDAbits.ACTPIX3
#define _ACTPIX4 G1ACTDAbits.ACTPIX4
#define _ACTPIX5 G1ACTDAbits.ACTPIX5
#define _ACTPIX6 G1ACTDAbits.ACTPIX6
#define _ACTPIX7 G1ACTDAbits.ACTPIX7
#define _ACTLINE0 G1ACTDAbits.ACTLINE0
#define _ACTLINE1 G1ACTDAbits.ACTLINE1
#define _ACTLINE2 G1ACTDAbits.ACTLINE2
#define _ACTLINE3 G1ACTDAbits.ACTLINE3
#define _ACTLINE4 G1ACTDAbits.ACTLINE4
#define _ACTLINE5 G1ACTDAbits.ACTLINE5
#define _ACTLINE6 G1ACTDAbits.ACTLINE6
#define _ACTLINE7 G1ACTDAbits.ACTLINE7

/* G1HSYNC */
#define _HSST G1HSYNCbits.HSST
#define _HSLEN G1HSYNCbits.HSLEN
#define _HSST0 G1HSYNCbits.HSST0
#define _HSST1 G1HSYNCbits.HSST1
#define _HSST2 G1HSYNCbits.HSST2
#define _HSST3 G1HSYNCbits.HSST3
#define _HSST4 G1HSYNCbits.HSST4
#define _HSST5 G1HSYNCbits.HSST5
#define _HSST6 G1HSYNCbits.HSST6
#define _HSST7 G1HSYNCbits.HSST7
#define _HSLEN0 G1HSYNCbits.HSLEN0
#define _HSLEN1 G1HSYNCbits.HSLEN1
#define _HSLEN2 G1HSYNCbits.HSLEN2
#define _HSLEN3 G1HSYNCbits.HSLEN3
#define _HSLEN4 G1HSYNCbits.HSLEN4
#define _HSLEN5 G1HSYNCbits.HSLEN5
#define _HSLEN6 G1HSYNCbits.HSLEN6
#define _HSLEN7 G1HSYNCbits.HSLEN7

/* G1VSYNC */
#define _VSST G1VSYNCbits.VSST
#define _VSLEN G1VSYNCbits.VSLEN
#define _VSST0 G1VSYNCbits.VSST0
#define _VSST1 G1VSYNCbits.VSST1
#define _VSST2 G1VSYNCbits.VSST2
#define _VSST3 G1VSYNCbits.VSST3
#define _VSST4 G1VSYNCbits.VSST4
#define _VSST5 G1VSYNCbits.VSST5
#define _VSST6 G1VSYNCbits.VSST6
#define _VSST7 G1VSYNCbits.VSST7
#define _VSLEN0 G1VSYNCbits.VSLEN0
#define _VSLEN1 G1VSYNCbits.VSLEN1
#define _VSLEN2 G1VSYNCbits.VSLEN2
#define _VSLEN3 G1VSYNCbits.VSLEN3
#define _VSLEN4 G1VSYNCbits.VSLEN4
#define _VSLEN5 G1VSYNCbits.VSLEN5
#define _VSLEN6 G1VSYNCbits.VSLEN6
#define _VSLEN7 G1VSYNCbits.VSLEN7

/* G1DBLCON */
#define _HENST G1DBLCONbits.HENST
#define _VENST G1DBLCONbits.VENST
#define _HENST0 G1DBLCONbits.HENST0
#define _HENST1 G1DBLCONbits.HENST1
#define _HENST2 G1DBLCONbits.HENST2
#define _HENST3 G1DBLCONbits.HENST3
#define _HENST4 G1DBLCONbits.HENST4
#define _HENST5 G1DBLCONbits.HENST5
#define _HENST6 G1DBLCONbits.HENST6
#define _HENST7 G1DBLCONbits.HENST7
#define _VENST0 G1DBLCONbits.VENST0
#define _VENST1 G1DBLCONbits.VENST1
#define _VENST2 G1DBLCONbits.VENST2
#define _VENST3 G1DBLCONbits.VENST3
#define _VENST4 G1DBLCONbits.VENST4
#define _VENST5 G1DBLCONbits.VENST5
#define _VENST6 G1DBLCONbits.VENST6
#define _VENST7 G1DBLCONbits.VENST7

