Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ128DA110.h
#define _RPOR13_RP27R5_POSITION                  0x0000000D
#define _RPOR13_RP27R5_MASK                      0x00002000
#define _RPOR13_RP27R5_LENGTH                    0x00000001

#define _RPOR14_RP28R_POSITION                   0x00000000
#define _RPOR14_RP28R_MASK                       0x0000003F
#define _RPOR14_RP28R_LENGTH                     0x00000006

#define _RPOR14_RP29R_POSITION                   0x00000008
#define _RPOR14_RP29R_MASK                       0x00003F00
#define _RPOR14_RP29R_LENGTH                     0x00000006

#define _RPOR14_RP28R0_POSITION                  0x00000000
#define _RPOR14_RP28R0_MASK                      0x00000001
#define _RPOR14_RP28R0_LENGTH                    0x00000001

#define _RPOR14_RP28R1_POSITION                  0x00000001
#define _RPOR14_RP28R1_MASK                      0x00000002
#define _RPOR14_RP28R1_LENGTH                    0x00000001

#define _RPOR14_RP28R2_POSITION                  0x00000002
#define _RPOR14_RP28R2_MASK                      0x00000004
#define _RPOR14_RP28R2_LENGTH                    0x00000001

#define _RPOR14_RP28R3_POSITION                  0x00000003
#define _RPOR14_RP28R3_MASK                      0x00000008
#define _RPOR14_RP28R3_LENGTH                    0x00000001

#define _RPOR14_RP28R4_POSITION                  0x00000004
#define _RPOR14_RP28R4_MASK                      0x00000010
#define _RPOR14_RP28R4_LENGTH                    0x00000001

#define _RPOR14_RP28R5_POSITION                  0x00000005
#define _RPOR14_RP28R5_MASK                      0x00000020
#define _RPOR14_RP28R5_LENGTH                    0x00000001

#define _RPOR14_RP29R0_POSITION                  0x00000008
#define _RPOR14_RP29R0_MASK                      0x00000100
#define _RPOR14_RP29R0_LENGTH                    0x00000001

#define _RPOR14_RP29R1_POSITION                  0x00000009
#define _RPOR14_RP29R1_MASK                      0x00000200
#define _RPOR14_RP29R1_LENGTH                    0x00000001

#define _RPOR14_RP29R2_POSITION                  0x0000000A
#define _RPOR14_RP29R2_MASK                      0x00000400
#define _RPOR14_RP29R2_LENGTH                    0x00000001

#define _RPOR14_RP29R3_POSITION                  0x0000000B
#define _RPOR14_RP29R3_MASK                      0x00000800
#define _RPOR14_RP29R3_LENGTH                    0x00000001

#define _RPOR14_RP29R4_POSITION                  0x0000000C
#define _RPOR14_RP29R4_MASK                      0x00001000
#define _RPOR14_RP29R4_LENGTH                    0x00000001

#define _RPOR14_RP29R5_POSITION                  0x0000000D
#define _RPOR14_RP29R5_MASK                      0x00002000
#define _RPOR14_RP29R5_LENGTH                    0x00000001

#define _RPOR15_RP30R_POSITION                   0x00000000
#define _RPOR15_RP30R_MASK                       0x0000003F
#define _RPOR15_RP30R_LENGTH                     0x00000006

#define _RPOR15_RP31R_POSITION                   0x00000008
#define _RPOR15_RP31R_MASK                       0x00003F00
#define _RPOR15_RP31R_LENGTH                     0x00000006

#define _RPOR15_RP30R0_POSITION                  0x00000000
#define _RPOR15_RP30R0_MASK                      0x00000001
#define _RPOR15_RP30R0_LENGTH                    0x00000001

#define _RPOR15_RP30R1_POSITION                  0x00000001
#define _RPOR15_RP30R1_MASK                      0x00000002
#define _RPOR15_RP30R1_LENGTH                    0x00000001

#define _RPOR15_RP30R2_POSITION                  0x00000002
#define _RPOR15_RP30R2_MASK                      0x00000004
#define _RPOR15_RP30R2_LENGTH                    0x00000001

#define _RPOR15_RP30R3_POSITION                  0x00000003
#define _RPOR15_RP30R3_MASK                      0x00000008
#define _RPOR15_RP30R3_LENGTH                    0x00000001

#define _RPOR15_RP30R4_POSITION                  0x00000004
#define _RPOR15_RP30R4_MASK                      0x00000010
#define _RPOR15_RP30R4_LENGTH                    0x00000001

#define _RPOR15_RP30R5_POSITION                  0x00000005
#define _RPOR15_RP30R5_MASK                      0x00000020
#define _RPOR15_RP30R5_LENGTH                    0x00000001

#define _RPOR15_RP31R0_POSITION                  0x00000008
#define _RPOR15_RP31R0_MASK                      0x00000100
#define _RPOR15_RP31R0_LENGTH                    0x00000001

#define _RPOR15_RP31R1_POSITION                  0x00000009
#define _RPOR15_RP31R1_MASK                      0x00000200
#define _RPOR15_RP31R1_LENGTH                    0x00000001

#define _RPOR15_RP31R2_POSITION                  0x0000000A
#define _RPOR15_RP31R2_MASK                      0x00000400
#define _RPOR15_RP31R2_LENGTH                    0x00000001

#define _RPOR15_RP31R3_POSITION                  0x0000000B
#define _RPOR15_RP31R3_MASK                      0x00000800
#define _RPOR15_RP31R3_LENGTH                    0x00000001

#define _RPOR15_RP31R4_POSITION                  0x0000000C
#define _RPOR15_RP31R4_MASK                      0x00001000
#define _RPOR15_RP31R4_LENGTH                    0x00000001

#define _RPOR15_RP31R5_POSITION                  0x0000000D
#define _RPOR15_RP31R5_MASK                      0x00002000
#define _RPOR15_RP31R5_LENGTH                    0x00000001

#define _G1CMDL_GCMD0_POSITION                   0x00000000
#define _G1CMDL_GCMD0_MASK                       0x00000001
#define _G1CMDL_GCMD0_LENGTH                     0x00000001

#define _G1CMDL_GCMD1_POSITION                   0x00000001
#define _G1CMDL_GCMD1_MASK                       0x00000002
#define _G1CMDL_GCMD1_LENGTH                     0x00000001

#define _G1CMDL_GCMD2_POSITION                   0x00000002
#define _G1CMDL_GCMD2_MASK                       0x00000004
#define _G1CMDL_GCMD2_LENGTH                     0x00000001

#define _G1CMDL_GCMD3_POSITION                   0x00000003
#define _G1CMDL_GCMD3_MASK                       0x00000008
#define _G1CMDL_GCMD3_LENGTH                     0x00000001

#define _G1CMDL_GCMD4_POSITION                   0x00000004
#define _G1CMDL_GCMD4_MASK                       0x00000010
#define _G1CMDL_GCMD4_LENGTH                     0x00000001

#define _G1CMDL_GCMD5_POSITION                   0x00000005
#define _G1CMDL_GCMD5_MASK                       0x00000020
#define _G1CMDL_GCMD5_LENGTH                     0x00000001

